app/controllers/articles_controller.rb

    def create

        @article = Article.new(params.require(:articles).permit(:title, :text,:category, :photo))
        @article.save
---
INSERT INTO `articles` (`title`, `text`, `photo_file_name`, `photo_content_type`, `photo_file_size`, `photo_updated_at`, `category`, `created_at`, `updated_at`) VALUES ('22', '22', '001.png', 'image/png', 2931, '2015-06-27 06:32:01', '전부', '2015-06-27 06:32:01', '2015-06-27 06:32:01')

    def index
        @articles = Article.all
---
SELECT `articles`.* FROM `articles`